"use strict"

// ==============================================================================

// Задача №1

// Що потрапить в консоль?

let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
};
 
// Відповідь: 

// Спочатку ми привласнюємо змінній someVar значення 0,
// далі інкрементом збільшуємо значення змінної на 1. 
// В результаті, якщо наша змінна існує (задана), то в консолі
// виведемо її поточне значення, а саме 1.

// ==============================================================================

// Задача №2

// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

// Відповідь: 

// Застосуємо цикл, в якому змінна "i" буде відповідати номеру пункту та на кожному 
// колі циклу збільшуватись на 1, починаючи від 1 і до 10. В консолі будемо виводити результат
// кожного кола, в якому, до виразу "Пункт №", будемо додавати значення змінної "і".

for (let i=1; i <= 10; ++i) {
	console.log(`Пункт №${i}`);
};

// ==============================================================================

// Задача №3

// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
};

// Відповідь: 

// Розберемо детально умову умовного розгалудження:

// Крок №1 - Застосуємо основні математичні оператори, отримаємо
// if ( 40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20")

// Крок №2 - Застосуємо оператори порівняння, отримаємо булеві значення true або false, отже
// 40 <= 10 - false, 15 < 5 - false, 10 <= "10" (не суворе порівняння) - true, 20 === "20" (суворе порівняння) - false, тож маємо 
// if (false || false && true || false)

// Крок №3 - Застосуємо логічний оператор &&. Так як, одне із значеннь false, то і результатом
// буде false, а отже
// if (false || false || false)

// Крок №4 - Застосуємо логічний оператор ||. Так як, усі значення у нас false, то і 
// загальний результат буде false. Тому кінцевий вираз набуває виду
// if (false) {
// 	console.log('000');
// }

// В результаті ми нічого не побачимо в консолі. Якщо ж у першому порівнянні змінити оператор на >=,
//  або в останньому замість === , поставити ==, то в консолі отримаємо 000.

// ==============================================================================

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 

// Відповідь:

function calcDiv (a, b) {
	let result = a / b;
	if (typeof a !== "number" || typeof b !== "number") {
		console.log("Введіть ДВА ЧИСЛА, а не оце все!");
	} else if (b == 0) {
	console.log("На нуль ділити не можна");
	} else {
		console.log(`Результат ділення: ${result}`);
	}
};
calcDiv();
calcDiv(0, 2);
calcDiv(2);
calcDiv(10, 0);
calcDiv(10, 2);
calcDiv(-10, 4);
calcDiv(-6, -2);
calcDiv("hello", 10);
calcDiv(0.4, 0.2);
calcDiv(4, "allo");

// ==============================================================================

// Задача №5

// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

//Відповідь: 

let someArray = [true, 6, 10, 100, "Вася"];
someArray.forEach(value => {
	if (value === 10) {
		console.log(value);
	}
});

// ==============================================================================
